webapp/app/controllers/categories_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 28658130)
---
  def new
    @category = params[:category_id] ?
      Subcategory.new(:category => Category.find(params[:category_id])) :

INSERT INTO "categories" ("name", "created_at", "updated_at", "category_id", "type") VALUES('New Category', '2011-11-25 18:18:37', '2011-11-25 18:18:37', NULL, NULL)
---
  def create
    if params[:category]
      @category = Category.create params[:category]