webapp/app/controllers/sessions_controller.rb

  def create
    if @current_user = User.find_by_login(params[:login]) and @current_user.password == params[:password]
---
SELECT * FROM "users" WHERE ("users"."login" = 'john') LIMIT 1